#include<fstream> // подключаем бибилеотеку чтени€/заипси в файл
#include <iostream> // подключаем бибилеотеку чтени€/заипси в консоль
using namespace std; // используем стандартное пространство имен (в котором находитс€ cout)

string swapInLine(string s) { // объ€вл€ем функцию помен€ть¬—троках типа string(строка), который будет принимать строку на вход
    for (int i = 0; i < s.length() - 1; i+=2) { // бежим циклом по входной строке, пропуска€ каждую второую букву (потому что еЄ мы уже переставили)
        char temp = s[i]; //классический приЄм замены двух переменных в массиве. «аписываем первую переменную во временную переменную.
        s[i] = s[i + 1]; // вместо первой пишем вторую переменную.
        s[i + 1] = temp; // на место второй переменной вставл€ем первую из временной переменной.
    }
    return s; // возвращаем изменнЄнную строку
}

int main() { // объ€вл€ем глувную функцию с типом int и без входных данных
    string input; // объ€вл€ем строчную переменную "ввод".
    ifstream in("input.txt"); // открываем поток на чтение из файла input.txt, им€ потока - in
    ofstream out("output.txt"); // открываем поток на запсь в файл output.txt, им€ потока - out
    if (!in.is_open() || !out.is_open()) { // если поток на ввод или на вывод не открыты
        cout << "Cant open file!"; // пишем в консоль "Ќе могу открыть файл!"
        return 0; // завершаем программу
    }
    while (getline(in, input)) { // читаем циклом строки из файла и записываем их в переменную "ввод", пока это возможно
        out << swapInLine(input) << "\n"; // печатаем в выходной файл результат работы функции помен€ть¬—троках, прин€вшую на вход считанную строку.
    }
    return 0; //завершае программу
}
