#include<iostream> // Подключаем библеотеку для ввода с консоли
#include<fstream> // Подключаем библеотеку для вывода в файл
/* подключаем стандартное пространство имён
 * для того, чтобы использовать из него имена функций
 * такие как cin, std и т.д.
*/
using namespace std;

int main() //Объявляем: В программе будет функция main типа int, аргументов принимать не будет (так как фигурные скобки пустые). Main – главная функция любой программы на С/С++
{ // Открываем тело функции main.
    /* Инициализация */
    int n, m; //объявляем: В программе будет две переменные типа int с именами n и m;
    cin >> n >> m; // вводим два чисzа с консоли, как сказанно в задаче
    /*
     * объявляем: в программе будет указатель
     * на массив указателей размером n, имя его будет A;
     */
    int **A = new int *[n];
    for (int i = 0; i < n; i++) //Используя цикл пробегаем массив указателей
    { // открываем тело цикла
        A[i] = new int[m];    //каждому указателю присваеваем свой массив размера m;
    } //закрываем тело цикла
    /*
     *  Открыавем поток c именем out на вывод в файл "output.txt".
     *  Заметим, что если указатно только имя файла и его расширение,
     *  программа будет работать с файлом, расположенным в той папке,
     *  откуда мы запускаем программу.
     *  Чтобы сказатать программе, что нужно использовать файл из другой папки
     *  используем её абсолютный путь. Например: "D:\Lab\1\output.txt".
     */
    /* Основной алгоритм */
    ofstream out("output.txt");
    /*
     *  проверяем, открылся ли файл вызовом функции is_open на потоке out.
     *  Файл может не открыться по многочисленным причинам
     *  (нет доступа, занят другой программой, невозможно найти и т.д)
     */
    if (out.is_open()) {  //открываем тело истинности условного оператора
        for (int i = 0; i < n; ++i) // Используя цикл пробегаем массив указателей (i - текущая строка)
        { //открываем тело цикла, бегущего по массиву указателей
            for (int j = 0; j < m; ++j) // Используя цикл пробегаем по массивам в указателях. ( j - текущий столбец)
                // Если нужно выполнить одну операцию ( операции в С/С++ разделяются знаком ';' то не обязательно ставить фигурные скобки.
                if (i == 0 ||  //выполняем проврку по условию задачи.  Если текущая строка – первая, или
                    i == n - 1 || //текущая строка – последняя, или
                    j == 0 || // текущий столбец – первый, или
                    j == m - 1) // текуший столбец – последний, то
                    out << 1; // вывести в файл единицу
                else
                    out << 0; //иначе вывести ноль.
            out << endl; // поставим знак переноса строки после проверки каждой строки
        } //закрываем тело цикла, бегущего по массиву указателей
    } // закрываем тело истинности условного оператора
    else //если файл не может быть открыт, то
    {
        cout << "File does not opened"; // выводим в консоль "Файл не открыт".
        return 0; // и сразу выключаем программу. (см. строку 63)
    }
    /* Очистка памяти */
    for (int i = 0; i < n; i++) // Используя цикл пробегаем массив указателей
        delete[] A[i];  //удаляем массивы в указателях
    delete[] A; //удаляем массив указателей
    /*
     * Выполнение функции завершается, когда она возвращает элемент типа этой функции.
     * Так как main – функция типа int, завершим главную функцию возвратом числа 0.
     */
    return 0;
} // закрываем тело функции main.
